app/Controllers/Bengkel.php

    public function registerin()
{
    $email = $this->request->getPost('email');
    $password = $this->request->getPost('password');

    $users = new \Myth\Auth\Models\UserModel();

    $existing = $users->where('email', $email)->first();
    if ($existing) {
        return redirect()->back()->with('error', 'Email sudah digunakan!');
    }

    $userData = [
        'email'         => $email,
        'username'      => explode('@', $email)[0],
        'password_hash' => \Myth\Auth\Password::hash($password),
        'active'        => 0,
    ];

    $users->save($userData);

    $user = $users->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'hazeltsaqifarrizqy@gmail.com'
AND `users`.`deleted_at` IS NULL
 LIMIT 1
INSERT INTO `users` (`email`, `username`, `password_hash`, `active`, `created_at`, `updated_at`) VALUES ('hazeltsaqifarrizqy@gmail.com', 'hazeltsaqifarrizqy', '$2y$10$iS7c26TtKkL/cbn64Cfja.rFkN9n7b9iGWGhvQa2otmUbMe/lvr7G', 0, '2025-11-12 07:14:43', '2025-11-12 07:14:43')